Channel/1D/R1000/0/RS_DNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "10000";
    object      RS_DNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor> 
1025
(
(2.09306e-07 -3.78978e-11 -7.72e-11 2.03268e-13 -1.67026e-15 9.05593e-08)
(1.67973e-06 -7.23204e-10 -6.22959e-10 8.41471e-12 -3.41705e-14 7.19898e-07)
(4.42856e-06 -2.99815e-09 -1.6509e-09 5.48053e-11 -1.50928e-13 1.88054e-06)
(8.43513e-06 -7.32041e-09 -3.15685e-09 1.58374e-10 -3.79818e-13 3.55629e-06)
(1.41322e-05 -1.66101e-08 -5.32018e-09 4.91767e-10 -9.14389e-13 5.89148e-06)
(2.1061e-05 -2.95091e-08 -7.96242e-09 9.92025e-10 -1.67102e-12 8.70727e-06)
(2.8245e-05 -4.35637e-08 -1.07062e-08 1.57056e-09 -2.50477e-12 1.16171e-05)
(3.92749e-05 -7.64366e-08 -1.49889e-08 3.45218e-09 -4.60219e-12 1.59236e-05)
...
)
;

boundaryField
{
    INLET
    {
        type            cyclic;
    }
    OUTLET
    {
        type            cyclic;
    }
    CENTER
    {
        type            symmetryPlane;
    }
    WALL
    {
        type            fixedValue;
        value           uniform (6.66667e-11 0 0 6.66667e-11 0 6.66667e-11);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
