Channel/1D/R1000/0/divRS_DNS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10000";
    object      divRS_DNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];


internalField   nonuniform List<vector> 
1025
(
(-9.85623e-06 -1.61873e-06 -4.64129e-10)
(-3.8188e-05 7.04111e-07 -1.92534e-09)
(-8.47521e-05 1.92616e-06 -4.44027e-09)
(-0.000174027 5.5844e-06 -9.75996e-09)
(-0.000282485 1.06123e-05 -1.6438e-08)
(-0.000341634 1.36727e-05 -2.01577e-08)
(-0.000591516 3.10006e-05 -3.69445e-08)
(-0.00082755 4.73686e-05 -5.28011e-08)
...
)
;

boundaryField
{
    INLET
    {
        type            cyclic;
    }
    OUTLET
    {
        type            cyclic;
    }
    CENTER
    {
        type            symmetryPlane;
    }
    WALL
    {
        type            extrapolatedCalculated;
        value           uniform (-9.85623e-06 -1.61873e-06 -4.64129e-10);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
