Channel/1D/R1000/Allrun
#! /bin/bash
nohup mpirun -np 2 simpleFoam -parallel >log_run 2>&1 &
# nohup mpirun -np 2 explicitRSFoam -parallel >log_run 2>&1 &
